# Задача_1: Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = input("Как вас зовут?: ")
b = int(input("Сколько вам лет?: "))
c = float(input("Какая у вас температура на данный момент?: "))
print(a, b, c)









